\ 双曲型方程显式算法文件 waveexpv.sch（先求速度再求位移，粘性阻尼）：
\ 空间离散后矩阵形式为
\                        [M][A]+[C][V]+[S][U] = [F]
\ 其中 V=dU/dt，A=dV/dt。对加速度 A 进行时间向后差分，刚度项保留前一时刻值可得
\                 [M]([V]-[ˉV])+[C][V]*Δt+[S][ˉU]*Δt = [F]*Δt
\ 其中 ˉV 记为 V 的前一时刻值，即 ˉV=V(t-Δt)，ˉU 同理，dt 为时间步长。整理得
\                 ([M]+[C]*Δt)[V] = [M][ˉV]-[S][ˉU]*Δt+[F]*Δt
\ ---------------------------------------------------------------------------
DEFI
STIF s
MASS m
DAMP c
LOAD f
TYPE w
MDTY l
INIT 2

COEF u

EQUATION
VECT u,v
\......... 读取解空间中的 u,v 作为上一时刻的位移和速度 ........../
READ(s,unod) u,v
\................. 线性方程组左端项(集中矩阵) .................../
L,MASS = [m]+[c]*dt
\...................... 线性方程组右端项 ......................../
FORC = [m*v]-[s*u]*dt+[f]*dt

SOLUTION v
VECT u,v
$cc // 通过 u = u+v*Δt 计算当前速度
[u] = [u]+[v]*dt
$cc // 存储求解得到的当前时刻位移和速度 u v
WRITE(o,unod) u,v

END
