\ 双曲型方程显式算法文件 waveexpur.sch（先求位移再求速度，瑞利阻尼）：
\ 基于双曲型方程显式算法(先求位移再求速度，粘性阻尼)时间空间离散后矩阵形式：
\        ([M]+[C]*Δt)[U] = [M][ˉV]*Δt+([M]+[C]*Δt-[S]*Δt*Δt)[ˉU]+[F]*Δt*Δt
\ 令 [U] = [ˉV]*Δt+[ˉU] 将上式阻尼项移到等式右边，得到：
\    [M][U] = [M][ˉV]*Δt+([M]+[C]*Δt-[S]*Δt*Δt)[ˉU]+[F]*Δt*Δt-[C]([ˉV]*Δt+[ˉU])*Δt
\ 定义瑞利阻尼为 [C] = b1[M]+b2[S] 带入上式并整理得	：
\    [M][U] = ([M]*(1-b1*Δt)*Δt-[S]*b2*Δt*Δt)[ˉV]+([M]-[S]*Δt*Δt)[ˉU]+[F]*Δt*Δt
\ ---------------------------------------------------------------------------------
DEFI
STIF s
MASS m
DAMP c
LOAD f
TYPE w
MDTY l
INIT 2

COEF u,v

EQUATION
VECT u,v
\.............. 读取解空间中的 u,v 作为上一时刻的位移和速度 ................/
READ(s,unod) u,v
\...................... 线性方程组左端项(集中矩阵).. ......................./
L,MASS = [m]
\........................... 线性方程组右端项 ............................../
FORC = [m*u]+[m*v]*(1-b1*dt)*dt-[s*u]*dt*dt-[s*v]*b2*dt*dt+[f]*dt*dt

SOLUTION u1
VECT u,v u1
$cc // 通过 v = (u1-u)/Δt 计算当前速度
[v] = ([u1]-[u])/dt
$cc // 将 u 更新为求出的 u1 
[u] = [u1]
$cc // 存储求解的当前时刻位移和速度 u v
WRITE(o,unod) u,v

@BEGIN
 double b1,b2;
  b1 = dampalfa; b2 = dampbeta; // 瑞利阻尼系数

END
