\ 抛物型方程算法文件 parb.sch
\ 空间离散后矩阵形式为：
\           [M][V]+[S][U]=[F]
\ 其中 V=dU/dt，取 Δt 为时间步长，对时间进行向后差分得到
\           [M]([U]-[ˉU])/Δt+[S][U]=[F]
\ 其中 ˉU 表示 U 的前一时刻值U(t-Δt)，整理后得到
\           ([M]+Δt*[S])[U]=Δt*[F]+[M][ˉU]
\ ---------------------------------------------------
DEFI
STIF s
MASS m
LOAD f
TYPE p
MDTY l
INIT 1

EQUATION
VECT u
\......... 读取解空间中的 u 作为上一时刻的位移 ........./
READ(s,unod) u
\............ 线性方程组左端项(分布矩阵) .............../
MATRIX = [s]*dt+[m]
\................. 线性方程组右端项 ..................../
FORC = [f]*dt+[m]*[u]

SOLUTION u
VECT u
$cc // 存储求解的当前时刻 u
WRITE(s,unod) u

END
