\ 双曲型方程显式算法文件 waveexpv.sch（先求速度再求位移，瑞利阻尼）：
\ 空间离散后矩阵形式为：
\                  [M][A]+[C][V]+[S][U] = [F]
\ 其中 V=dU/dt，A=dV/dt。对加速度 A 进行时间向前差分，载荷项更新为新时刻值得：
\            [M]([Vˉ]-[V])+[C][V]*Δt+[S][U]*Δt = [Fˉ]*Δt
\ 其中 Vˉ 记为 V 的后一时刻值，即 Vˉ=V(t+Δt)，Δt 为时间步长。整理得：
\            [M][Vˉ] = ([M]-[C]*Δt)[V]-[S][U]*Δt+[Fˉ]*Δt
\ 定义瑞利阻尼为 [C] = b1[M]+b2[S] 带入上式并整理得：
\      [M][Vˉ] = [M][V]*(1-b1*Δt)-[S][V]*b2*Δt-[S][U]*Δt+[Fˉ]*Δt
\ -----------------------------------------------------------------------
DEFI
STIF s
MASS m
DAMP c
LOAD f
TYPE w
MDTY l
INIT 2

EQUATION
VECT u,v
\......... 读取解空间中的 u,v 作为上一时刻的位移和速度 ........../
READ(s,unod) u,v
\................. 线性方程组左端项(集中矩阵) .................../
L,MASS = [m]
\...................... 线性方程组右端项 ......................../
FORC = [m*v]*(1-b1*dt)-[s*u]*dt-[s*v]*b2*dt+[f]*dt

SOLUTION v
VECT u,v
$cc // 通过 u = u+v*Δt 计算当前速度
[u] = [u]+[v]*dt
$cc // 存储求解得到的当前时刻位移和速度 u v
WRITE(o,unod) u,v

@BEGIN
 double b1,b2;
  b1 = dampalfa; b2 = dampbeta; // 瑞利阻尼系数

END
